{
  "regions": [
    {
      "id": "tarragon",
      "name": "The Kingdom of Tarragon",
      "coords": "219,258,107",
      "blurb": "The birthplace of the West’s downfall.",
      "lore": "Once the fertile heartland of the West, Tarragon rose when Zuläch united the Western Realms. But beneath Dsärr he broke the ancient seal, awakening the force sealed by the Old Treaty. Corruption surged outward, twisting land and creatures alike. All blight across the Enen Sea originates here.",
      "effect": "corrupted"
    },
    {
      "id": "aeyantis",
      "name": "Aeyantis Kingdom",
      "coords": "1218,370,53",
      "blurb": "The oldest of the kingdoms, ruled by Queen Ahris.",
      "lore": "Aeyantis is the heart of civilisation and the seat of Queen Ahris. Here the Guardian Lumyrion was summoned—an ancient relic awakened only when chaos threatens the world. Aeyantis stands as one of the last bastions of order as the realm collapses around it.",
      "effect": "glow"
    },
    {
      "id": "katzh",
      "name": "Katzh Kingdom",
      "coords": "1006,584,42",
      "blurb": "A quiet, reflective kingdom of serene forests and calm waters.",
      "lore": "Katzh, ruled by the formless sovereign Yutanari, lies far from Tarragon’s direct influence. Though its mist-laden lands sense the imbalance spreading across the Enen Sea, Katzh itself remains uncorrupted. Its people act as watchers of the world’s shifting tides, preparing for the moment the darkness reaches their borders.",
      "effect": "glow"
    },
    {
      "id": "dreonathen",
      "name": "Dreonathen Kingdom",
      "coords": "508,512,48",
      "blurb": "A warrior kingdom standing between East and West.",
      "lore": "Dreonathen, ruled by King Diogenes, formed the shield between the Western Realms and the Six Kingdoms. Their stone fortresses were the first to face Tarragon’s spread. Though strong, their borders tremble as corruption pushes closer.",
      "effect": "glow"
    },
    {
      "id": "yan",
      "name": "Yán Realm",
      "coords": "52,117,37",
      "blurb": "A fractured realm known for its sky-watchers.",
      "lore": "Under Domiyán, the Yán Realm once observed the heavens for signs of destiny. When Zuläch united the West, Yán followed—but corruption now divides its people. Some cling to Tarragon’s order; others flee from the spreading darkness.",
      "effect": "corrupted"
    },
    {
      "id": "edresan",
      "name": "Edresan Realm",
      "coords": "170,93,55",
      "blurb": "One of the Western Realms absorbed into Tarragon.",
      "lore": "Ruled by Qadril, Edresan stood beside Zuläch during the unification of the West. Their marsh strongholds and covert alliances gave him the advantage needed to form Tarragon. Now corruption seeps through the wetlands, twisting both land and allegiance.",
      "effect": "corrupted"
    },
    {
      "id": "kithren",
      "name": "Kithren Queendom",
      "coords": "548,268,23",
      "blurb": "A bright queendom now standing against encroaching shadow.",
      "lore": "Kithren, ruled by Queen Keisth, once flourished on harmony and enchantment. Its shimmering stone cities have grown quiet as Tarragon’s blight approaches, blackening their once-luminous forests and silencing their choral wildlife.",
      "effect": "corrupted"
    },
    {
      "id": "vulcaria",
      "name": "Vulcaria Kingdom",
      "coords": "1004,118,32",
      "blurb": "A volcanic kingdom of ancient fire.",
      "lore": "Vulcaria, ruled by Queen Olorus, stands on rivers of molten rock. The kingdom’s fire-wrought fortresses resist corruption, yet tremors beneath the volcanic halls suggest Tarragon’s influence is reaching deep into the earth’s oldest veins.",
      "effect": "glow"
    },
    {
      "id": "amexore",
      "name": "Ame’xore Kingdom",
      "coords": "645,154,33",
      "blurb": "A kingdom of winds, peaks, and hidden archives.",
      "lore": "Ruled by Queen Teri'itaria, Ame’xore protects vast archives of lost languages and ancient records. Scholars race to decode forgotten texts as corruption rides the mountain winds toward their sky temples.",
      "effect": "corrupted"
    },
    {
      "id": "brigachin",
      "name": "Brigachin Realm",
      "coords": "1254,196,42",
      "blurb": "A harsh northern realm bordering Aeyantis.",
      "lore": "Brigachin, ruled by Broyagia, lies just north of Aeyantis, separated by fortified ridgelines and cold highlands. Despite this proximity, Brigachin has long isolated itself from the affairs of the Six Kingdoms. When Queen Ahris warned of rising corruption, Brigachin dismissed it as an eastern burden. But now distortions creep through their northern passes—proof that even their rigid traditions cannot hold back the spreading chaos.",
      "effect": "glow"
    }
  ],
  "creatures": [
    {
      "id": "megalore",
      "name": "Megalore Domain",
      "coords": "1245,655,70",
      "danger": "High",
      "blurb": "A colossal apex predator ruling the deep coastal waters.",
      "lore": "Megalore stalks the warm currents near Katzh and the southern Aeyantis coast. Sailors say the tides shift when it hunts, and whole ships vanish without a cry. Its massive, angular head slices through both waves and hulls, marking it the terror of the Enen Sea.",
      "effect": "water-glow"
    },
    {
      "id": "lycara",
      "name": "Ly’cara Hunting Grounds",
      "coords": "560,475,60",
      "danger": "Medium",
      "blurb": "Territorial forest hunters who never stalk alone.",
      "lore": "The Ly’cara roam the shadow-thick forests between Kithren and Dreonathen. Swift, coordinated, and fiercely territorial, their cries echo through the trees long before a pack is seen. Many believe they are nature’s first warning before greater dangers draw near.",
      "effect": "forest-mist"
    },
    {
      "id": "gortusk",
      "name": "Gortusk Highlands",
      "coords": "1085,270,65",
      "danger": "High",
      "blurb": "Armored war-beasts forged by volcanic heat.",
      "lore": "In the volcanic plains of Vulcaria, the Gortusk thrive among molten rock and ash storms. Their armored hides are said to be tougher than forged steel. When a herd stampedes, the ground itself trembles under the weight of living battering rams.",
      "effect": "ember-glow"
    },
    {
      "id": "deep_abyssal",
      "name": "Deep Abyssal Trenches",
      "coords": "220,650,85",
      "danger": "Extreme",
      "blurb": "Towering horrors from the lightless depths.",
      "lore": "In the northern ocean trenches, where light has never touched, the Deep Abyssal rise from fathomless voids. Standing taller than most mortal architecture, these beings twist water and shadow alike. Their presence signals an ancient darkness stirring beneath the waves.",
      "effect": "abyss-dark"
    },
    {
      "id": "cyrenthos",
      "name": "Cyrenthos Valley",
      "coords": "360,340,55",
      "danger": "High",
      "blurb": "Savage valley predators warped by Tarragon’s corruption.",
      "lore": "Once noble valley guardians, the Cyrenthos were twisted when Tarragon fell to Saar’s corruption. Their equine bodies carry monstrous upper torsos, driven by a rage not fully their own. They patrol the borderlands between Dreonathen and Tarragon, striking down anything that crosses.",
      "effect": "corruption-flicker"
    },
    {
      "id": "mighty_troll",
      "name": "Mighty Troll of Tarragon",
      "coords": "230,295,110",
      "danger": "Cataclysmic",
      "blurb": "The corrupted titan that rules Tarragon’s core.",
      "lore": "Once Zuläch of Dsärr, now the living vessel of Saar’s hatred. The Mighty Troll towers above all creatures, wrapped in dark energy that rots the land beneath its feet. Every step spreads corruption. Every roar shakes kingdoms. Defeating it is the only hope to end the unraveling of the Enen Sea.",
      "effect": "void-corruption"
    }
  ]
}
